{
  "audire": "Latin verb meaning 'to hear'. The name of this application.",
  "algorithm": "A process or set of rules to be followed in calculations or other problem-solving operations.",
  "application": "A program or piece of software designed and written to fulfill a particular purpose of the user.",
  "audio": "Sound, especially when recorded, transmitted, or reproduced.",
  "book": "A written or printed work consisting of pages glued or sewn together along one side and bound in covers.",
  "code": "A system of words, letters, figures, or other symbols substituted for other words, letters, etc., especially for secrecy.",
  "compiler": "A program that converts instructions into a machine-code or lower-level form so that they can be read and executed by a computer.",
  "computer": "An electronic device for storing and processing data.",
  "data": "Facts and statistics collected together for reference or analysis.",
  "database": "A structured set of data held in a computer, especially one that is accessible in various ways.",
  "debug": "Identify and remove errors from (computer hardware or software).",
  "developer": "A person or thing that develops something.",
  "digital": "Expressed as series of the digits 0 and 1, typically represented by values of a physical quantity such as voltage or magnetic polarization.",
  "flutter": "An open-source UI software development kit created by Google.",
  "function": "A basic task of a computer, especially one that corresponds to a single instruction from the user.",
  "hardware": "The machines, wiring, and other physical components of a computer or other electronic system.",
  "interface": "A point where two systems, subjects, organizations, etc., meet and interact.",
  "internet": "A global computer network providing a variety of information and communication facilities.",
  "java": "A general-purpose computer-programming language that is concurrent, class-based, object-oriented, and specifically designed to have as few implementation dependencies as possible.",
  "library": "A collection of precompiled routines that a program can use.",
  "memory": "The faculty by which the mind stores and remembers information.",
  "mobile": "Able to move or be moved freely or easily.",
  "network": "A group or system of interconnected people or things.",
  "offline": "Not connected to a computer or computer network.",
  "online": "Controlled by or connected to another computer or to a network.",
  "pdf": "Portable Document Format, a file format that provides an electronic image of text or text and graphics.",
  "processor": "A machine that processes something.",
  "program": "Provide (a computer or other machine) with coded instructions for the automatic performance of a task.",
  "protocol": "The official procedure or system of rules governing affairs of state or diplomatic occasions.",
  "python": "A high-level general-purpose programming language.",
  "read": "Look at and comprehend the meaning of (written or printed matter) by mentally interpreting the characters or symbols of which it is composed.",
  "screen": "A fixed or movable upright partition used to divide a room, to give shelter from drafts or heat, or to provide concealment.",
  "search": "Try to find something by looking or otherwise seeking carefully and thoroughly.",
  "server": "A computer or computer program that manages access to a centralized resource or service in a network.",
  "software": "The programs and other operating information used by a computer.",
  "storage": "The action or method of storing something for future use.",
  "syntax": "The arrangement of words and phrases to create well-formed sentences in a language.",
  "system": "A set of connected things or parts forming a complex whole.",
  "technology": "The application of scientific knowledge for practical purposes.",
  "terminal": "A device at which a user enters data or commands for a computer system and displays the received output.",
  "user": "A person who uses or operates something, especially a computer or other machine.",
  "variable": "Not consistent or having a fixed pattern; liable to change.",
  "virtual": "Almost or nearly as described, but not completely or according to strict definition.",
  "voice": "The sound produced in a person's larynx and uttered through the mouth, as speech or song.",
  "web": "A complex system of interconnected elements.",
  "wireless": "Using radio, microwaves, etc. (as opposed to wires or cables) to transmit signals.",
  "zambia": "A landlocked country in southern Africa."
}